# Posttest 2

# Import Package
Library Pandas

In [26]:
import pandas as pd

# Membaca Dataset

In [27]:
data = pd.read_csv("bmw.csv")
data.head()

,model,year,price,transmission,mileage,fuelType,tax,mpg,engineSize
0,5 Series,2014,11200,Automatic,67068,Diesel,125,57.6,2.0
1,6 Series,2018,27000,Automatic,14827,Petrol,145,42.8,2.0
2,5 Series,2016,16000,Automatic,62794,Diesel,160,51.4,3.0
3,1 Series,2017,12750,Automatic,26676,Diesel,145,72.4,1.5
4,7 Series,2014,14500,Automatic,39554,Diesel,160,50.4,3.0

# Informasi Dataset

In [28]:
totalrecord = len(data)
attribute = list(data.columns)
objek = len(data.select_dtypes(include=['object']).columns)
angka = len(data.select_dtypes(include=['int64', 'float64']).columns)
NULL = len(data.columns[data.isna().sum() > 0])


dict = {
    "Total Record"            : totalrecord,
    "Nama Attribute"          : attribute,
    "Jumlah Attribute Objek"  : objek,
    "Jumlah Attribute Angka"  : angka,
    "Jumlah NULL"             : NULL,
}

pd.Series(dict)

Total Record                                                          10781
Nama Attribute            [model, year, price, transmission, mileage, fu...
Jumlah Attribute Objek                                                    3
Jumlah Attribute Angka                                                    6
Jumlah NULL                                                               0
dtype: object

# Atribut Bertipe Angka 

**year**\
**price**\
**mileage**\
**tax**\
**mpg**\
**engineSize**

# Menampilkan Nilai Rata-Rata 

Menampilkan rata-rata dengan fungsi mean()

In [29]:
data[["price","mileage","tax","mpg","engineSize"]].mean()

price         22733.408867
mileage       25496.986550
tax             131.702068
mpg              56.399035
engineSize        2.167767
dtype: float64

# Menampilkan Nilai Standar Deviasi

Menampilkan standar deviasi dengan fungsi std()

In [30]:
data[["price","mileage","tax","mpg","engineSize"]].std()

price         11415.528189
mileage       25143.192559
tax              61.510755
mpg              31.336958
engineSize        0.552054
dtype: float64

# Menampilkan Nilai Minimum
Menampilkan minimum dengan fungsi min()

In [31]:
data[["price","mileage","tax","mpg","engineSize"]].min()

price         1200.0
mileage          1.0
tax              0.0
mpg              5.5
engineSize       0.0
dtype: float64

# Menampilkan Nilai Maksimum
Menampilkan maksimum dengan fungsi max()

In [32]:
data[["price","mileage","tax","mpg","engineSize"]].max()

price         123456.0
mileage       214000.0
tax              580.0
mpg              470.8
engineSize         6.6
dtype: float64

# Menampilkan Q1, Q2, Q3 
Menampilkan kuantil dengan fungsi quantile()

**0.25 untuk Q1**\
**0.5  untuk Q2**\
**0.75 untuk Q3**

In [33]:
data[["price","mileage","tax","mpg","engineSize"]].quantile([0.25,0.5,0.75])

        price  mileage    tax   mpg  engineSize
0.25  14950.0   5529.0  135.0  45.6         2.0
0.50  20462.0  18347.0  145.0  53.3         2.0
0.75  27940.0  38206.0  145.0  62.8         2.0

# Menampilkan Statistik Deskriptif

Menampilkan total record, rata-rata, simpangan baku, nilai minimum, maksimum,\
dan kuantil dengan menggunakan fungsi **describe()**

In [34]:
data[["price","mileage","tax","mpg","engineSize"]].describe()

               price        mileage           tax           mpg    engineSize
count   10781.000000   10781.000000  10781.000000  10781.000000  10781.000000
mean    22733.408867   25496.986550    131.702068     56.399035      2.167767
std     11415.528189   25143.192559     61.510755     31.336958      0.552054
min      1200.000000       1.000000      0.000000      5.500000      0.000000
25%     14950.000000    5529.000000    135.000000     45.600000      2.000000
50%     20462.000000   18347.000000    145.000000     53.300000      2.000000
75%     27940.000000   38206.000000    145.000000     62.800000      2.000000
max    123456.000000  214000.000000    580.000000    470.800000      6.600000

# Menampilkan Nilai Korelasi

Menampilkan nilai korelasi dengan fungsi corr()

In [35]:
data[["price","mileage","tax","mpg","engineSize"]].corr()

               price   mileage       tax       mpg  engineSize
price       1.000000 -0.605397  0.263484 -0.204882    0.460196
mileage    -0.605397  1.000000 -0.170747  0.118609   -0.002540
tax         0.263484 -0.170747  1.000000 -0.351798    0.429616
mpg        -0.204882  0.118609 -0.351798  1.000000   -0.399844
engineSize  0.460196 -0.002540  0.429616 -0.399844    1.000000

# Merubah Atributte Menjadi Angka Bulat

Atributte yang akan dirubah yaitu **Global_Sales** yang sebelumnya bilangan Desimal menjadi bilangan Bulat\
dengan menggunakan fungsi **astype()**

In [36]:
print("Sebelum Di Ubah : ",data["mpg"].dtypes)

data["mpg"] = data["mpg"].astype('int64')

print("Setelah Di Ubah : ", data["mpg"].dtypes)

Sebelum Di Ubah :  float64
Setelah Di Ubah :  int64

# Menampilkan Attribute Bertipe Angka


Data yang ditampilkan yaitu 10 record pertama dengan fungsi head()\
10 merupakan berapa banyak record yang ingin ditampilkan

In [37]:
data.select_dtypes(include=['int64', 'float64']).head()

   year  price  mileage  tax  mpg  engineSize
0  2014  11200    67068  125   57         2.0
1  2018  27000    14827  145   42         2.0
2  2016  16000    62794  160   51         3.0
3  2017  12750    26676  145   72         1.5
4  2014  14500    39554  160   50         3.0

# Export Record ke File csv Baru

Record yang di Export ke file csv baru merupakan attribute bertipe angka

In [39]:
data.select_dtypes(include=['int64', 'float64']).to_csv("atribut angka.csv", index=False)